000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. VNDDSP01.
000300*------------------------------------------------
000400* Muestra las entradas del vendor file
000500*------------------------------------------------
000600 ENVIRONMENT DIVISION.
000700 INPUT-OUTPUT SECTION.
000800 FILE-CONTROL.
000900
001000     SELECT ARCHIVO-PROVEEDOR
001100     ASSIGN TO "vendor-file"
001200     ORGANIZATION IS INDEXED
001300     RECORD KEY IS NUMERO-PROVEEDOR
001400     ACCESS MODE IS DYNAMIC.
001500
001600 DATA DIVISION.
001700 FILE SECTION.
001800
001900 FD ARCHIVO-PROVEEDOR
002000     LABEL RECORDS ARE STANDARD.
002100 01 REGISTRO-PROVEEDOR.
002200     05 NUMERO-PROVEEDOR PIC 9(5).
002300     05 NOMBRE-PROVEEDOR PIC X(30).
002400     05 DIRECCION-PROVEEDOR-1 PIC X(30).
002500     05 DIRECCION-PROVEEDOR-2 PIC X(30).
002600     05 CIUDAD-PROVEEDOR PIC X(20).
002700     05 ESTADO-PROVEEDOR PIC X(2).
002800     05 CODIGO-POSTAL-PROVEEDOR PIC X(10).
002900     05 CONTACTO-PROVEEDOR PIC X(30).
003000     05 TELEFONO-PROVEEDOR PIC X(15).
003100
003200
003300
003400
003500 WORKING-STORAGE SECTION.
003600
003700
003800
003900 01 LINEA-DETALLE.
004000     05 MOSTRAR-NUMERO PIC 9(5).
004100     05 RELLENO PIC X VALUE SPACE.
004200     05 MOSTRAR-NOMBRE PIC X(30).
004300     05 RELLENO PIC X VALUE SPACE.
004400     05 MOSTRAR-CONTACTO PIC X(30).
004500
004600 01 DETALLE-CIUDAD-ESTADO.
004700     05 MOSTRAR-CIUDAD PIC X(20).
004800     05 RELLENO PIC X VALUE SPACE.
004900     05 MOSTRAR-ESTADO PIC X(2).
005000
005100 01 LINEA-COLUMNA.
005200     05 RELLENO PIC X(2) VALUE "NO".
005300     05 RELLENO PIC X(4) VALUE SPACE.
005400     05 RELLENO PIC X(12) VALUE "NAME-ADDRESS".
005500     05 RELLENO PIC X(19) VALUE SPACE.
005600     05 RELLENO PIC X(17) VALUE "CONTACT-PHONE-ZIP".
005700
005800 01 LINEA-TITULO.
005900     05 RELLENO PIC X(15) VALUE SPACE.
006000     05 RELLENO PIC X(11)
006100         VALUE "VENDOR LIST".
006200     05 RELLENO PIC X(15) VALUE SPACE.
006300     05 RELLENO PIC X(5) VALUE "PAGE:".
006400     05 RELLENO PIC X(1) VALUE SPACE.
006500     05 MOSTRAR-NUMERO-PAGINA PIC ZZZZ9.
006600
006700 77  FIN-ARCHIVO PIC X.
006800 77  UN-FICTICIO PIC X.
006900 77  CONTADOR-LINEA PIC 999 VALUE ZERO.
007000 77  NUMERO-PAGINA PIC 99999 VALUE ZERO.
007100 77  MAXIMO-LINEAS PIC 999 VALUE 15.
007200
007300 77  MOSTRAR-REGISTRO PIC X(79).
007400
007500 PROCEDURE DIVISION.
007600 PROGRAMA-INICIO.
007700
007800     PERFORM PROCEDIMIENTO-APERTURA.
007900     MOVE ZEROES TO CONTADOR-LINEA
008000                     NUMERO-PAGINA.
008100
008200     PERFORM INICIAR-NUEVA-PAGINA.
008300
008400     MOVE "N" TO FIN-ARCHIVO.
008500     PERFORM LEER-REGISTRO-SIGUIENTE.
008600     IF FIN-ARCHIVO = "Y"
008700     MOVE "NO RECORDS FOUND" TO MOSTRAR-REGISTRO
008800     PERFORM ESCRIBIR-MOSTRAR-REGISTRO
008900     ELSE
009000     PERFORM MOSTRAR-CAMPOS-PROVEEDOR
009100     UNTIL FIN-ARCHIVO = "Y".
009200
009300     PERFORM PROCEDIMIENTO-CIERRE.
009400
009500
009600 PROGRAMA-TERMINADO.
009700     STOP RUN.
009800
009900 PROCEDIMIENTO-APERTURA.
010000     OPEN I-O ARCHIVO-PROVEEDOR.
010100
010200 PROCEDIMIENTO-CIERRE.
010300     CLOSE ARCHIVO-PROVEEDOR.
010400
010500 MOSTRAR-CAMPOS-PROVEEDOR.
010600     IF CONTADOR-LINEA > MAXIMO-LINEAS
010700         PERFORM INICIAR-PAGINA-SIGUIENTE.
010800     PERFORM ESCRIBIR-Y-MOSTRAR-REGISTRO.
010900     PERFORM LEER-REGISTRO-SIGUIENTE.
011000
011100 ESCRIBIR-Y-MOSTRAR-REGISTRO.
011200     PERFORM MOSTRAR-LINEA-1.
011300     PERFORM MOSTRAR-LINEA-2.
011400     PERFORM MOSTRAR-LINEA-3.
011500     PERFORM MOSTRAR-LINEA-4.
011600     PERFORM SALTO-LINEA.
011700
011800 MOSTRAR-LINEA-1.
011900     MOVE SPACE TO LINEA-DETALLE.
012000     MOVE NUMERO-PROVEEDOR TO MOSTRAR-NUMERO.
012100     MOVE NOMBRE-PROVEEDOR TO MOSTRAR-NOMBRE.
012200     MOVE CONTACTO-PROVEEDOR TO MOSTRAR-CONTACTO.
012300     MOVE LINEA-DETALLE TO MOSTRAR-REGISTRO.
012400     PERFORM ESCRIBIR-MOSTRAR-REGISTRO.
012500
012600 MOSTRAR-LINEA-2.
012700     MOVE SPACE TO LINEA-DETALLE.
012800     MOVE DIRECCION-PROVEEDOR-1 TO MOSTRAR-NOMBRE.
012900     MOVE TELEFONO-PROVEEDOR TO MOSTRAR-CONTACTO.
013000     MOVE LINEA-DETALLE TO MOSTRAR-REGISTRO.
013100     PERFORM ESCRIBIR-MOSTRAR-REGISTRO.
013200
013300 MOSTRAR-LINEA-3.
013400     MOVE SPACE TO LINEA-DETALLE.
013500     MOVE DIRECCION-PROVEEDOR-2 TO MOSTRAR-NOMBRE.
013600     IF DIRECCION-PROVEEDOR-2 NOT = SPACE
013700     MOVE LINEA-DETALLE TO MOSTRAR-REGISTRO
013800     PERFORM ESCRIBIR-MOSTRAR-REGISTRO.
013900
014000 MOSTRAR-LINEA-4.
014100     MOVE SPACE TO LINEA-DETALLE.
014200     MOVE CIUDAD-PROVEEDOR TO MOSTRAR-CIUDAD.
014300     MOVE ESTADO-PROVEEDOR TO MOSTRAR-ESTADO.
014400     MOVE DETALLE-CIUDAD-ESTADO TO MOSTRAR-NOMBRE.
014500     MOVE CODIGO-POSTAL-PROVEEDOR TO MOSTRAR-CONTACTO.
014600     MOVE LINEA-DETALLE TO MOSTRAR-REGISTRO.
014700     PERFORM ESCRIBIR-MOSTRAR-REGISTRO.
014800
014900 LEER-REGISTRO-SIGUIENTE.
015000     READ ARCHIVO-PROVEEDOR NEXT RECORD
015100         AT END MOVE "Y" TO FIN-ARCHIVO.
015200
015300 ESCRIBIR-MOSTRAR-REGISTRO.
015400     DISPLAY MOSTRAR-REGISTRO.
015500     ADD 1 TO CONTADOR-LINEA.
015600
015700 SALTO-LINEA.
015800     MOVE SPACE TO MOSTRAR-REGISTRO.
015900     PERFORM ESCRIBIR-MOSTRAR-REGISTRO.
016000
016100 INICIAR-PAGINA-SIGUIENTE.
016200
016300     PERFORM FINALIZAR-ULTIMA-PAGINA.
016400     PERFORM INICIAR-NUEVA-PAGINA.
016500
016600 INICIAR-NUEVA-PAGINA.
016700     ADD 1 TO NUMERO-PAGINA.
016800     MOVE NUMERO-PAGINA TO MOSTRAR-NUMERO-PAGINA.
016900     MOVE LINEA-TITULO TO MOSTRAR-REGISTRO.
017000     PERFORM ESCRIBIR-MOSTRAR-REGISTRO.
017100     PERFORM SALTO-LINEA.
017200     MOVE LINEA-COLUMNA TO MOSTRAR-REGISTRO.
017300     PERFORM ESCRIBIR-MOSTRAR-REGISTRO.
017400     PERFORM SALTO-LINEA.
017500
017600 FINALIZAR-ULTIMA-PAGINA.
017700     PERFORM PRESIONAR-ENTER.
017800     MOVE ZERO TO CONTADOR-LINEA.
017900
018000 PRESIONAR-ENTER.
018100     DISPLAY "PRESS ENTER TO CONTINUE. . .".
018200     ACCEPT UN-FICTICIO.
018300
