000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. VENDOR.
000300*------------------------------------------------
000400* Crear un Archivo de Vendor Vacio.
000500*------------------------------------------------
000600 ENVIRONMENT DIVISION.
000700 INPUT-OUTPUT SECTION.
000800 FILE-CONTROL.
000900
001000     SELECT ARCHIVO-PROVEEDOR
001100     ASSIGN TO "vendor-file"
001200     ORGANIZATION IS INDEXED
001300     RECORD KEY IS NUMERO-PROVEEDOR
001400     ACCESS MODE IS DYNAMIC.
001500
001600 DATA DIVISION.
001700 FILE SECTION.
001800
001900 FD  ARCHIVO-PROVEEDOR
002000     LABEL RECORDS ARE STANDARD.
002100 01  REGISTRO-PROVEEDOR.
002200     05 NUMERO-PROVEEDOR PIC 9(5).
002300     05 NOMBRE-PROVEEDOR PIC X(30).
002400     05 DIRECCION-PROVEEDOR-1 PIC X(30).
002500     05 DIRECCION-PROVEEDOR-2 PIC X(30).
002600     05 CIUDAD-PROVEEDOR PIC X(20).
002700     05 ESTADO-PROVEEDOR PIC X(2).
002800     05 CODIGO-POSTAL-PROVEEDOR PIC X(10).
002900     05 CONTACTO-PROVEEDOR PIC X(30).
003000     05 TELEFONO-PROVEEDOR PIC X(15).
003100
003200 WORKING-STORAGE SECTION.
003300
003400 PROCEDURE DIVISION.
003500 PROGRAMA-EMPIEZA.
003600     OPEN OUTPUT ARCHIVO-PROVEEDOR.
003700     CLOSE ARCHIVO-PROVEEDOR.
003800
003900 PROGRAMA-TERMINA.
004000     STOP RUN.
004100
